In [5]:
import pandas as pd

In [2]:
#series

In [3]:
series_name = pd.Series(["Tom","Raj","Rahul","Tina","Kajol"])

In [4]:
series_name

0      Tom
1      Raj
2    Rahul
3     Tina
4    Kajol
dtype: object

In [6]:
roll=["roll-1","roll-2","roll-3","roll-4","roll-5"]

In [7]:
series_name = pd.Series(["Tom","Raj","Rahul","Tina","Kajol"],index=roll)

In [8]:
series_name

roll-1      Tom
roll-2      Raj
roll-3    Rahul
roll-4     Tina
roll-5    Kajol
dtype: object

In [9]:
dict_name={"roll-1":"Tom","roll-2":"Raj","roll-3":"Rahul","roll-4":"Tina","roll-5":"Kajol"}

In [10]:
dict_name

{'roll-1': 'Tom',
 'roll-2': 'Raj',
 'roll-3': 'Rahul',
 'roll-4': 'Tina',
 'roll-5': 'Kajol'}

In [11]:
name = pd.Series(dict_name)

In [12]:
name

roll-1      Tom
roll-2      Raj
roll-3    Rahul
roll-4     Tina
roll-5    Kajol
dtype: object

In [13]:
nums= [800678,800456]

In [14]:
names = ["Richie","Mark"]

In [15]:
series_1 = pd.Series(nums)

In [16]:
series_2 = pd.Series(nums,index=names)

In [17]:
print(series_1)

0    800678
1    800456
dtype: int64

In [18]:
print(series_2)

Richie    800678
Mark      800456
dtype: int64

In [20]:
name=pd.Series('Tom','James','Ricky','Vin','Steve','Smith','Jack')

TypeError: __init__() takes from 1 to 7 positional arguments but 8 were given

In [21]:
name=pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack'])

In [22]:
age=pd.Series([25,26,25,23,30,29,23])

In [23]:
rating=pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8])

In [25]:
dict1={"Name":name,"Age":age,"Rating":rating}

In [26]:
df_stud=pd.DataFrame(dict1)

In [27]:
df_stud

    Name  Age  Rating
0    Tom   25    4.23
1  James   26    3.24
2  Ricky   25    3.98
3    Vin   23    2.56
4  Steve   30    3.20
5  Smith   29    4.60
6   Jack   23    3.80

In [29]:
df_stud1 = df_stud.T

In [30]:
df_stud1

           0      1      2     3      4      5     6
Name     Tom  James  Ricky   Vin  Steve  Smith  Jack
Age       25     26     25    23     30     29    23
Rating  4.23   3.24   3.98  2.56    3.2    4.6   3.8

In [33]:
df_stud.dtypes

Name       object
Age         int64
Rating    float64
dtype: object

In [37]:
df_stud.head(2)

    Name  Age  Rating
0    Tom   25    4.23
1  James   26    3.24

In [38]:
df_stud.tail(2)

    Name  Age  Rating
5  Smith   29     4.6
6   Jack   23     3.8

In [39]:
df_stud.shape

(7, 3)

In [40]:
#print the first two rows
df_stud.iloc[0:2,:]

    Name  Age  Rating
0    Tom   25    4.23
1  James   26    3.24

In [41]:
#print the first 2 columns
df_stud.iloc[:,0:2]

    Name  Age
0    Tom   25
1  James   26
2  Ricky   25
3    Vin   23
4  Steve   30
5  Smith   29
6   Jack   23

In [42]:
#to print the first and third column
df_stud.iloc[:,[0,2]]

    Name  Rating
0    Tom    4.23
1  James    3.24
2  Ricky    3.98
3    Vin    2.56
4  Steve    3.20
5  Smith    4.60
6   Jack    3.80

In [45]:
#print second, fourth and sixth row
df_stud.iloc[[1,3,5],:]

    Name  Age  Rating
1  James   26    3.24
3    Vin   23    2.56
5  Smith   29    4.60

In [47]:
#renaming a column
df_stud.rename(columns={"Name":"First_name"},inplace=True)

In [48]:
df_stud.rename(columns={"Rating":"Score"},inplace=True)

In [49]:
df_stud

  First_name  Age  Score
0        Tom   25   4.23
1      James   26   3.24
2      Ricky   25   3.98
3        Vin   23   2.56
4      Steve   30   3.20
5      Smith   29   4.60
6       Jack   23   3.80

In [52]:
df_stud1=df_stud.drop("Score",axis=1)

In [53]:
df_stud1

  First_name  Age
0        Tom   25
1      James   26
2      Ricky   25
3        Vin   23
4      Steve   30
5      Smith   29
6       Jack   23

In [54]:
df_stud2 = df_stud.drop(1,axis=0)

In [55]:
df_stud2

  First_name  Age  Score
0        Tom   25   4.23
2      Ricky   25   3.98
3        Vin   23   2.56
4      Steve   30   3.20
5      Smith   29   4.60
6       Jack   23   3.80

In [56]:
#sort the data by rating
df_stud.sort_values(by="Score")

  First_name  Age  Score
3        Vin   23   2.56
4      Steve   30   3.20
1      James   26   3.24
6       Jack   23   3.80
2      Ricky   25   3.98
0        Tom   25   4.23
5      Smith   29   4.60

In [57]:
df_stud.sort_values(by="Score",ascending=False)

  First_name  Age  Score
5      Smith   29   4.60
0        Tom   25   4.23
2      Ricky   25   3.98
6       Jack   23   3.80
1      James   26   3.24
4      Steve   30   3.20
3        Vin   23   2.56

In [58]:
df_stud[(df_stud["Age"]>=23) & (df_stud["Age"]<=25)]

  First_name  Age  Score
0        Tom   25   4.23
2      Ricky   25   3.98
3        Vin   23   2.56
6       Jack   23   3.80

In [60]:
#print the records of Smith or James
df_stud[(df_stud["First_name"]=="Smith") | (df_stud["First_name"]=="James")]

  First_name  Age  Score
1      James   26   3.24
5      Smith   29   4.60

In [61]:
df_grade=read.csv("E:\rstudio files\grade_score.csv")

NameError: name 'read' is not defined